Revit 2027 API
ParameterTypeId.StructuralBeamOrientation Property
 "Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamOrientation { get; }
Public Shared ReadOnly Property StructuralBeamOrientation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamOrientation {
	ForgeTypeId^ get ();
}
static member StructuralBeamOrientation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace